In [1]:
#!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\anaconda\lib\site-packages (8.0.24)
Collecting protobuf>=3.0.0
  Downloading protobuf-3.15.8-py2.py3-none-any.whl (173 kB)
Requirement already satisfied: six>=1.9 in c:\anaconda\lib\site-packages (from protobuf>=3.0.0->mysql-connector-python) (1.15.0)
Installing collected packages: protobuf
Successfully installed protobuf-3.15.8

In [2]:
import mysql.connector

In [3]:
import pandas as pd
con=mysql.connector.connect(
    host="localhost",
    port=3306,
    user="root",
    password="datatrained9110",
    database="empdb")

df=pd.read_sql_query("select * from employee",con)
df

   empid   ename         emailid  deptid
0      1   henry   henry@abc.com    1001
1      2     sam     sam@bbc.com    1001
2      3    john    john@ccc.com    1002
3      4  mathew  mathew@dcc.com    1003
4      5    jack    jack@ecc.com    1004

In [4]:
df=pd.read_sql_query("select * from employee where empid=1 ",con)
df

   empid  ename        emailid  deptid
0      1  henry  henry@abc.com    1001

In [6]:
df=pd.read_sql_query("select * from employee where empid=3 ",con)
df

   empid ename       emailid  deptid
0      3  john  john@ccc.com    1002

In [7]:
df=pd.read_sql_query("select * from employee where deptid=1004 ",con)
df

   empid ename       emailid  deptid
0      5  jack  jack@ecc.com    1004